app/controllers/command_controller.rb

  def exists
    output = Command.find(:first, :conditions => ['name = ?', params['name']]) ? 'true' : 'false'
---
SELECT * FROM `commands` WHERE (name = 'rails_two_point_three') LIMIT 1

  def add_command
    url = params['command']['url']
    # Call prefix_with_url_if_necessary before prefix_with_http_if_necessary, because the latter checks
    # if the url begins with { [Jon Aquino 2005-07-17]
    url = prefix_with_url_if_necessary url
    url = prefix_with_http_if_necessary url
    if not params['test_button'].nil?
      test_command url, params['test_command']
      return
    end
    if not params['view_url_button'].nil?
      view_url url, params['test_command']
      return
    end
    if request.method != :post then
      # If the method is get, the request is probably from a spam # bot. Redirect as normal,
      # but do not add the command. [Jon Aquino 2005-06-10]
      redirect_after_add_command
      return
    end
    if BannedUrlPattern.find(:first, :conditions => ["? LIKE pattern", url]) then
---
SELECT * FROM `banned_url_patterns` WHERE ('http://weblog.rubyonrails.org/2011/8/16/ann-rails-2-3-14/' LIKE pattern) LIMIT 1

    end
    # Only ban a url if it hasn't been entered earlier than an hour # ago. Otherwise clever spammers
    # will ban good url's that have been around for a long time. [Jon # Aquino 2005-06-11]
    matching_commands = Command.find(:all, :conditions => ['url = ?', url])
---
SELECT * FROM `commands` WHERE (url = 'http://weblog.rubyonrails.org/2011/8/16/ann-rails-2-3-14/')

    command.url = url
    command.description = params['command']['description']
    command.creation_date = Time.now
    if command.save
---
INSERT INTO `commands` (`name`, `golden_egg_date`, `url`, `description`, `spam`, `uses`, `creation_date`, `last_use_date`) VALUES('rails_two_point_three', NULL, 'http://weblog.rubyonrails.org/2011/8/16/ann-rails-2-3-14/', 'teeeest', 0, 0, '2012-08-28 22:59:00', NULL)